trade_exp/src/Catalogs/Альтерра_НастройкиОбменаБитрикс/Альтерра_НастройкиОбменаБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0dc9ff5f-2ffc-4bde-b4a5-5d621ea722fc">
  <name>Альтерра_НастройкиОбменаБитрикс</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="686ac427-0e1e-447e-a4ed-8719455cf1f0">
    <name>ИдПапкиСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="141f5cbc-430b-44df-b95e-6f96478e7534">
    <name>ЗначенияСписковДляОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5d0eab30-8f11-4ffa-bf92-878c6a45e155">
      <name>ИдПоляСпискаВБитриксе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c6d86706-5e15-4184-a2b6-6db9770197de">
      <name>Объект1С</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="610b9995-1524-4d96-8c79-f7d7aec0fb88">
      <name>Идентификатор</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1e2e52d1-5e2d-4318-864e-7cda1932742e">
    <name>РеквизитыТипаСписок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="22504fce-c58c-4885-8aaa-63e591f69851">
      <name>ИдПоля</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d174b8e4-bb18-4a4d-8482-375917e36129">
      <name>НаименованиеПоляБитрикс</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Альтерра_НастройкиОбменаБитрикс/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Код = СтрЗаменить(Объект.Наименование, " ","_");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокВыбора();
	ИзменитьФильтр("");
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСоставСписочныхРеквизитов(Команда)
	Элементы.ГруппаРеквизитыТипаСписок.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСписок(Команда)
	Записать();
	Элементы.ГруппаРеквизитыТипаСписок.Видимость = Ложь;
	ОбновитьСписокВыбора();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбора()
		РеквизитыТипаСписок = Объект.РеквизитыТипаСписок;
		ПолеВыбора = Элементы.ПолеБитрикс;
		ПолеВыбора.СписокВыбора.Очистить();
		Для номСтр=0 по РеквизитыТипаСписок.Количество()-1 Цикл 
			ПолеВыбора.СписокВыбора.Добавить(РеквизитыТипаСписок[номСтр].ИдПоля, РеквизитыТипаСписок[номСтр].НаименованиеПоляБитрикс);
		КонецЦикла;
		Если ПолеВыбора.СписокВыбора.Количество() > 0 Тогда
			ИзменитьФильтр(ПолеВыбора.СписокВыбора[0]);
		КонецЕсли;
КонецПроцедуры // ОбновитьСписокВыбора()


&НаКлиенте
Процедура ПолеБитриксОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИзменитьФильтр(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ИзменитьФильтр(ЗначениеФильтрации)
	Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ИдПоляСпискаВБитриксе", ЗначениеФильтрации));
	Элементы.ЗначенияСписковДляОбъекта.ОтборСтрок = Отбор;
КонецПроцедуры // ИзменитьФильтр()

&НаКлиенте
Процедура ЗначенияСписковДляОбъектаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элемент.ТекущиеДанные.ИдПоляСпискаВБитриксе = ПолеБитрикс;
	Модифицированность = Истина;
КонецПроцедуры
